MikroElektronika/core_packages/PIC/XC8/def/PIC18F45K42/mcu.h
// Generated 05/01/2024 GMT

/*
 * Copyright © 2024, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 * 
 * This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without modification, are
 * permitted provided that the following conditions are met:
 * 
 *     1. Redistributions of source code must retain the above copyright notice, this list of
 *        conditions and the following disclaimer.
 * 
 *     2. Redistributions in binary form must reproduce the above copyright notice, this list
 *        of conditions and the following disclaimer in the documentation and/or other
 *        materials provided with the distribution. Publication is not required when
 *        this file is used in an embedded application.
 * 
 *     3. Microchip's name may not be used to endorse or promote products derived from this
 *        software without specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef _PIC18F45K42_H_
#define _PIC18F45K42_H_

/*
 * C Header file for the Microchip PIC Microcontroller
 * PIC18F45K42
 */
#ifndef _XC_H_
#warning Header file pic18f45k42.h included directly. Use #include <xc.h> instead.
#endif

#include <__at.h>

/*
 * Interrupt Source IRQ numbers
 */

// Software Interrupt
#define                                 IRQ_SWINT           0
// HLVD Interrupt
#define                                 IRQ_HLVD            1
// Oscillator Failure Interrupt
#define                                 IRQ_OSF             2
// Clock Switch Interrupt
#define                                 IRQ_CSW             3
// NVM Interrupt
#define                                 IRQ_NVM             4
// Scanner Interrupt
#define                                 IRQ_SCAN            5
// CRC Interrupt
#define                                 IRQ_CRC             6
// Interrupt on change
#define                                 IRQ_IOC             7
// External Interrupt 0
#define                                 IRQ_INT0            8
// ZCD Interrupt
#define                                 IRQ_ZCD             9
// ADC Interrupt
#define                                 IRQ_AD              10
// ADC Treshold Interrupt
#define                                 IRQ_ADT             11
// Comparator 1 Interrupt
#define                                 IRQ_CMP1            12
// SMT1 Interrupt
#define                                 IRQ_SMT1            13
// SMT1 Period acqusition Interrupt
#define                                 IRQ_SMT1PRA         14
// SMT1 Pulse width acqusition Interrupt
#define                                 IRQ_SMT1PRW         15
// DMA1 Source count Interrupt
#define                                 IRQ_DMA1SCNT        16
// DMA1 Destination count Interrupt
#define                                 IRQ_DMA1DCNT        17
// DMA1 Overflow Interrupt
#define                                 IRQ_DMA1OR          18
// DMA1 Abort Interrupt
#define                                 IRQ_DMA1A           19
// SPI1 Receive Interrupt
#define                                 IRQ_SPI1RX          20
// SPI1 Transmit Interrupt
#define                                 IRQ_SPI1TX          21
// SPI1 Interrupt
#define                                 IRQ_SPI1            22
// I2C1 Receive Interrupt
#define                                 IRQ_I2C1RX          23
// I2C1 Transmit Interrupt
#define                                 IRQ_I2C1TX          24
// I2C1 Interrupt
#define                                 IRQ_I2C1            25
// I2C1 Error Interrupt
#define                                 IRQ_I2C1E           26
// UART1 Receive Interrupt
#define                                 IRQ_U1RX            27
// UART1 Transmit Interrupt
#define                                 IRQ_U1TX            28
// UART1 Error Interrupt
#define                                 IRQ_U1E             29
// UART1 Interrupt
#define                                 IRQ_U1              30
// Timer0 Interrupt
#define                                 IRQ_TMR0            31
// Timer1 Interrupt
#define                                 IRQ_TMR1            32
// Timer1 Gate Interrupt
#define                                 IRQ_TMR1G           33
// Timer2 Interrupt
#define                                 IRQ_TMR2            34
// CCP1 Interrupt
#define                                 IRQ_CCP1            35
// NCO1 Interrupt
#define                                 IRQ_NCO1            37
// CWG1 Interrupt
#define                                 IRQ_CWG1            38
// CLC1 Interrupt
#define                                 IRQ_CLC1            39
// External Interrupt 1
#define                                 IRQ_INT1            40
// Comparator 2 Interrupt
#define                                 IRQ_CMP2            41
// DMA2 Source count Interrupt
#define                                 IRQ_DMA2SCNT        42
// DMA2 Destination count Interrupt
#define                                 IRQ_DMA2DCNT        43
// DMA2 Overflow Interrupt
#define                                 IRQ_DMA2OR          44
// DMA2 Abort Interrupt
#define                                 IRQ_DMA2A           45
// I2C2 Receive Interrupt
#define                                 IRQ_I2C2RX          46
// I2C2 Transmit Interrupt
#define                                 IRQ_I2C2TX          47
// I2C2 Interrupt
#define                                 IRQ_I2C2            48
// I2C2 Error Interrupt
#define                                 IRQ_I2C2E           49
// UART2 Receive Interrupt
#define                                 IRQ_U2RX            50
// UART2 Transmit Interrupt
#define                                 IRQ_U2TX            51
// UART2 Error Interrupt
#define                                 IRQ_U2E             52
// UART2 Interrupt
#define                                 IRQ_U2              53
// Timer3 Interrupt
#define                                 IRQ_TMR3            54
// Timer3 Gate Interrupt
#define                                 IRQ_TMR3G           55
// Timer4 Interrupt
#define                                 IRQ_TMR4            56
// CCP2 Interrupt
#define                                 IRQ_CCP2            57
// CWG2 Interrupt
#define                                 IRQ_CWG2            59
// CLC2 Interrupt
#define                                 IRQ_CLC2            60
// External Interrupt 2
#define                                 IRQ_INT2            61
// Timer5 Interrupt
#define                                 IRQ_TMR5            70
// Timer5 Gate Interrupt
#define                                 IRQ_TMR5G           71
// Timer6 Interrupt
#define                                 IRQ_TMR6            72
// CCP3 Interrupt
#define                                 IRQ_CCP3            73
// CWG3 Interrupt
#define                                 IRQ_CWG3            74
// CLC3 Interrupt
#define                                 IRQ_CLC3            75
// CCP4 Interrupt
#define                                 IRQ_CCP4            80
// CLC4 Interrupt
#define                                 IRQ_CLC4            81
/*
 * Device Information Area (DIA) Table
 */

#define DIA_MUI                                             0x3F0000
#define DIA_MUI0                                            0x3F0000
#define DIA_MUI1                                            0x3F0002
#define DIA_MUI2                                            0x3F0004
#define DIA_MUI3                                            0x3F0006
#define DIA_MUI4                                            0x3F0008
#define DIA_MUI5                                            0x3F000A
#define DIA_MUI6                                            0x3F000C
#define DIA_MUI7                                            0x3F000E

