MikroElektronika/core_packages/PIC/XC8/def/PIC18F45K42/mcu.h
#define                                 DMA2BUF2_bit        _BIT_ACCESS(DMA2BUF,2)
// DMA2BUF<DMA2BUF3>
extern volatile __bit                   DMA2BUF3            __at(0x1DE4B);	// @ (0x3BC9 * 8 + 3)
#define                                 DMA2BUF3_bit        _BIT_ACCESS(DMA2BUF,3)
// DMA2BUF<DMA2BUF4>
extern volatile __bit                   DMA2BUF4            __at(0x1DE4C);	// @ (0x3BC9 * 8 + 4)
#define                                 DMA2BUF4_bit        _BIT_ACCESS(DMA2BUF,4)
// DMA2BUF<DMA2BUF5>
extern volatile __bit                   DMA2BUF5            __at(0x1DE4D);	// @ (0x3BC9 * 8 + 5)
#define                                 DMA2BUF5_bit        _BIT_ACCESS(DMA2BUF,5)
// DMA2BUF<DMA2BUF6>
extern volatile __bit                   DMA2BUF6            __at(0x1DE4E);	// @ (0x3BC9 * 8 + 6)
#define                                 DMA2BUF6_bit        _BIT_ACCESS(DMA2BUF,6)
// DMA2BUF<DMA2BUF7>
extern volatile __bit                   DMA2BUF7            __at(0x1DE4F);	// @ (0x3BC9 * 8 + 7)
#define                                 DMA2BUF7_bit        _BIT_ACCESS(DMA2BUF,7)
// DMA2DCNTL<DMA2DCNT0>
extern volatile __bit                   DMA2DCNT0           __at(0x1DE50);	// @ (0x3BCA * 8 + 0)
#define                                 DMA2DCNT0_bit       _BIT_ACCESS(DMA2DCNTL,0)
// DMA2DCNTL<DMA2DCNT1>
extern volatile __bit                   DMA2DCNT1           __at(0x1DE51);	// @ (0x3BCA * 8 + 1)
#define                                 DMA2DCNT1_bit       _BIT_ACCESS(DMA2DCNTL,1)
// DMA2DCNTH<DMA2DCNT10>
extern volatile __bit                   DMA2DCNT10          __at(0x1DE5A);	// @ (0x3BCB * 8 + 2)
#define                                 DMA2DCNT10_bit      _BIT_ACCESS(DMA2DCNTH,2)
// DMA2DCNTH<DMA2DCNT11>
extern volatile __bit                   DMA2DCNT11          __at(0x1DE5B);	// @ (0x3BCB * 8 + 3)
#define                                 DMA2DCNT11_bit      _BIT_ACCESS(DMA2DCNTH,3)
// DMA2DCNTL<DMA2DCNT2>
extern volatile __bit                   DMA2DCNT2           __at(0x1DE52);	// @ (0x3BCA * 8 + 2)
#define                                 DMA2DCNT2_bit       _BIT_ACCESS(DMA2DCNTL,2)
// DMA2DCNTL<DMA2DCNT3>
extern volatile __bit                   DMA2DCNT3           __at(0x1DE53);	// @ (0x3BCA * 8 + 3)
#define                                 DMA2DCNT3_bit       _BIT_ACCESS(DMA2DCNTL,3)
// DMA2DCNTL<DMA2DCNT4>
extern volatile __bit                   DMA2DCNT4           __at(0x1DE54);	// @ (0x3BCA * 8 + 4)
#define                                 DMA2DCNT4_bit       _BIT_ACCESS(DMA2DCNTL,4)
// DMA2DCNTL<DMA2DCNT5>
extern volatile __bit                   DMA2DCNT5           __at(0x1DE55);	// @ (0x3BCA * 8 + 5)
#define                                 DMA2DCNT5_bit       _BIT_ACCESS(DMA2DCNTL,5)
// DMA2DCNTL<DMA2DCNT6>
extern volatile __bit                   DMA2DCNT6           __at(0x1DE56);	// @ (0x3BCA * 8 + 6)
#define                                 DMA2DCNT6_bit       _BIT_ACCESS(DMA2DCNTL,6)
// DMA2DCNTL<DMA2DCNT7>
extern volatile __bit                   DMA2DCNT7           __at(0x1DE57);	// @ (0x3BCA * 8 + 7)
#define                                 DMA2DCNT7_bit       _BIT_ACCESS(DMA2DCNTL,7)
// DMA2DCNTH<DMA2DCNT8>
extern volatile __bit                   DMA2DCNT8           __at(0x1DE58);	// @ (0x3BCB * 8 + 0)
#define                                 DMA2DCNT8_bit       _BIT_ACCESS(DMA2DCNTH,0)
// DMA2DCNTH<DMA2DCNT9>
extern volatile __bit                   DMA2DCNT9           __at(0x1DE59);	// @ (0x3BCB * 8 + 1)
#define                                 DMA2DCNT9_bit       _BIT_ACCESS(DMA2DCNTH,1)
// PIE5<DMA2DCNTIE>
extern volatile __bit                   DMA2DCNTIE          __at(0x1CCAB);	// @ (0x3995 * 8 + 3)
#define                                 DMA2DCNTIE_bit      _BIT_ACCESS(PIE5,3)
// PIR5<DMA2DCNTIF>
extern volatile __bit                   DMA2DCNTIF          __at(0x1CD2B);	// @ (0x39A5 * 8 + 3)
#define                                 DMA2DCNTIF_bit      _BIT_ACCESS(PIR5,3)
// IPR5<DMA2DCNTIP>
extern volatile __bit                   DMA2DCNTIP          __at(0x1CC2B);	// @ (0x3985 * 8 + 3)
#define                                 DMA2DCNTIP_bit      _BIT_ACCESS(IPR5,3)
// DMA2CON0<DMA2DGO>
extern volatile __bit                   DMA2DGO             __at(0x1DEE5);	// @ (0x3BDC * 8 + 5)
#define                                 DMA2DGO_bit         _BIT_ACCESS(DMA2CON0,5)
// DMA2DPTRL<DMA2DPTR0>
extern volatile __bit                   DMA2DPTR0           __at(0x1DE60);	// @ (0x3BCC * 8 + 0)
#define                                 DMA2DPTR0_bit       _BIT_ACCESS(DMA2DPTRL,0)
// DMA2DPTRL<DMA2DPTR1>
extern volatile __bit                   DMA2DPTR1           __at(0x1DE61);	// @ (0x3BCC * 8 + 1)
#define                                 DMA2DPTR1_bit       _BIT_ACCESS(DMA2DPTRL,1)
// DMA2DPTRH<DMA2DPTR10>
extern volatile __bit                   DMA2DPTR10          __at(0x1DE6A);	// @ (0x3BCD * 8 + 2)
#define                                 DMA2DPTR10_bit      _BIT_ACCESS(DMA2DPTRH,2)
// DMA2DPTRH<DMA2DPTR11>
extern volatile __bit                   DMA2DPTR11          __at(0x1DE6B);	// @ (0x3BCD * 8 + 3)
#define                                 DMA2DPTR11_bit      _BIT_ACCESS(DMA2DPTRH,3)
// DMA2DPTRH<DMA2DPTR12>
extern volatile __bit                   DMA2DPTR12          __at(0x1DE6C);	// @ (0x3BCD * 8 + 4)
#define                                 DMA2DPTR12_bit      _BIT_ACCESS(DMA2DPTRH,4)
// DMA2DPTRH<DMA2DPTR13>
extern volatile __bit                   DMA2DPTR13          __at(0x1DE6D);	// @ (0x3BCD * 8 + 5)
#define                                 DMA2DPTR13_bit      _BIT_ACCESS(DMA2DPTRH,5)
// DMA2DPTRH<DMA2DPTR14>
extern volatile __bit                   DMA2DPTR14          __at(0x1DE6E);	// @ (0x3BCD * 8 + 6)
#define                                 DMA2DPTR14_bit      _BIT_ACCESS(DMA2DPTRH,6)
// DMA2DPTRH<DMA2DPTR15>
extern volatile __bit                   DMA2DPTR15          __at(0x1DE6F);	// @ (0x3BCD * 8 + 7)
#define                                 DMA2DPTR15_bit      _BIT_ACCESS(DMA2DPTRH,7)
// DMA2DPTRL<DMA2DPTR2>
extern volatile __bit                   DMA2DPTR2           __at(0x1DE62);	// @ (0x3BCC * 8 + 2)
#define                                 DMA2DPTR2_bit       _BIT_ACCESS(DMA2DPTRL,2)
// DMA2DPTRL<DMA2DPTR3>
extern volatile __bit                   DMA2DPTR3           __at(0x1DE63);	// @ (0x3BCC * 8 + 3)
#define                                 DMA2DPTR3_bit       _BIT_ACCESS(DMA2DPTRL,3)
// DMA2DPTRL<DMA2DPTR4>
extern volatile __bit                   DMA2DPTR4           __at(0x1DE64);	// @ (0x3BCC * 8 + 4)
#define                                 DMA2DPTR4_bit       _BIT_ACCESS(DMA2DPTRL,4)
// DMA2DPTRL<DMA2DPTR5>
extern volatile __bit                   DMA2DPTR5           __at(0x1DE65);	// @ (0x3BCC * 8 + 5)
#define                                 DMA2DPTR5_bit       _BIT_ACCESS(DMA2DPTRL,5)
// DMA2DPTRL<DMA2DPTR6>
extern volatile __bit                   DMA2DPTR6           __at(0x1DE66);	// @ (0x3BCC * 8 + 6)
#define                                 DMA2DPTR6_bit       _BIT_ACCESS(DMA2DPTRL,6)
// DMA2DPTRL<DMA2DPTR7>
extern volatile __bit                   DMA2DPTR7           __at(0x1DE67);	// @ (0x3BCC * 8 + 7)
#define                                 DMA2DPTR7_bit       _BIT_ACCESS(DMA2DPTRL,7)
// DMA2DPTRH<DMA2DPTR8>
extern volatile __bit                   DMA2DPTR8           __at(0x1DE68);	// @ (0x3BCD * 8 + 0)
#define                                 DMA2DPTR8_bit       _BIT_ACCESS(DMA2DPTRH,0)
// DMA2DPTRH<DMA2DPTR9>
extern volatile __bit                   DMA2DPTR9           __at(0x1DE69);	// @ (0x3BCD * 8 + 1)
#define                                 DMA2DPTR9_bit       _BIT_ACCESS(DMA2DPTRH,1)
// DMA2DSAL<DMA2DSA0>
extern volatile __bit                   DMA2DSA0            __at(0x1DE80);	// @ (0x3BD0 * 8 + 0)
#define                                 DMA2DSA0_bit        _BIT_ACCESS(DMA2DSAL,0)
// DMA2DSAL<DMA2DSA1>
extern volatile __bit                   DMA2DSA1            __at(0x1DE81);	// @ (0x3BD0 * 8 + 1)
#define                                 DMA2DSA1_bit        _BIT_ACCESS(DMA2DSAL,1)
// DMA2DSAH<DMA2DSA10>
extern volatile __bit                   DMA2DSA10           __at(0x1DE8A);	// @ (0x3BD1 * 8 + 2)
#define                                 DMA2DSA10_bit       _BIT_ACCESS(DMA2DSAH,2)
// DMA2DSAH<DMA2DSA11>
extern volatile __bit                   DMA2DSA11           __at(0x1DE8B);	// @ (0x3BD1 * 8 + 3)
#define                                 DMA2DSA11_bit       _BIT_ACCESS(DMA2DSAH,3)
// DMA2DSAH<DMA2DSA12>
extern volatile __bit                   DMA2DSA12           __at(0x1DE8C);	// @ (0x3BD1 * 8 + 4)
#define                                 DMA2DSA12_bit       _BIT_ACCESS(DMA2DSAH,4)
// DMA2DSAH<DMA2DSA13>
extern volatile __bit                   DMA2DSA13           __at(0x1DE8D);	// @ (0x3BD1 * 8 + 5)
#define                                 DMA2DSA13_bit       _BIT_ACCESS(DMA2DSAH,5)
// DMA2DSAH<DMA2DSA14>
extern volatile __bit                   DMA2DSA14           __at(0x1DE8E);	// @ (0x3BD1 * 8 + 6)
#define                                 DMA2DSA14_bit       _BIT_ACCESS(DMA2DSAH,6)
// DMA2DSAH<DMA2DSA15>
extern volatile __bit                   DMA2DSA15           __at(0x1DE8F);	// @ (0x3BD1 * 8 + 7)
#define                                 DMA2DSA15_bit       _BIT_ACCESS(DMA2DSAH,7)
// DMA2DSAL<DMA2DSA2>
extern volatile __bit                   DMA2DSA2            __at(0x1DE82);	// @ (0x3BD0 * 8 + 2)
#define                                 DMA2DSA2_bit        _BIT_ACCESS(DMA2DSAL,2)
// DMA2DSAL<DMA2DSA3>
extern volatile __bit                   DMA2DSA3            __at(0x1DE83);	// @ (0x3BD0 * 8 + 3)
#define                                 DMA2DSA3_bit        _BIT_ACCESS(DMA2DSAL,3)
// DMA2DSAL<DMA2DSA4>
extern volatile __bit                   DMA2DSA4            __at(0x1DE84);	// @ (0x3BD0 * 8 + 4)
#define                                 DMA2DSA4_bit        _BIT_ACCESS(DMA2DSAL,4)
// DMA2DSAL<DMA2DSA5>
extern volatile __bit                   DMA2DSA5            __at(0x1DE85);	// @ (0x3BD0 * 8 + 5)
#define                                 DMA2DSA5_bit        _BIT_ACCESS(DMA2DSAL,5)
// DMA2DSAL<DMA2DSA6>
extern volatile __bit                   DMA2DSA6            __at(0x1DE86);	// @ (0x3BD0 * 8 + 6)
#define                                 DMA2DSA6_bit        _BIT_ACCESS(DMA2DSAL,6)
// DMA2DSAL<DMA2DSA7>
extern volatile __bit                   DMA2DSA7            __at(0x1DE87);	// @ (0x3BD0 * 8 + 7)
#define                                 DMA2DSA7_bit        _BIT_ACCESS(DMA2DSAL,7)
// DMA2DSAH<DMA2DSA8>
extern volatile __bit                   DMA2DSA8            __at(0x1DE88);	// @ (0x3BD1 * 8 + 0)
#define                                 DMA2DSA8_bit        _BIT_ACCESS(DMA2DSAH,0)
// DMA2DSAH<DMA2DSA9>
extern volatile __bit                   DMA2DSA9            __at(0x1DE89);	// @ (0x3BD1 * 8 + 1)
#define                                 DMA2DSA9_bit        _BIT_ACCESS(DMA2DSAH,1)
// DMA2DSZL<DMA2DSZ0>
extern volatile __bit                   DMA2DSZ0            __at(0x1DE70);	// @ (0x3BCE * 8 + 0)
#define                                 DMA2DSZ0_bit        _BIT_ACCESS(DMA2DSZL,0)
// DMA2DSZL<DMA2DSZ1>
extern volatile __bit                   DMA2DSZ1            __at(0x1DE71);	// @ (0x3BCE * 8 + 1)
#define                                 DMA2DSZ1_bit        _BIT_ACCESS(DMA2DSZL,1)
// DMA2DSZH<DMA2DSZ10>
extern volatile __bit                   DMA2DSZ10           __at(0x1DE7A);	// @ (0x3BCF * 8 + 2)
#define                                 DMA2DSZ10_bit       _BIT_ACCESS(DMA2DSZH,2)
// DMA2DSZH<DMA2DSZ11>
extern volatile __bit                   DMA2DSZ11           __at(0x1DE7B);	// @ (0x3BCF * 8 + 3)
#define                                 DMA2DSZ11_bit       _BIT_ACCESS(DMA2DSZH,3)
// DMA2DSZL<DMA2DSZ2>
extern volatile __bit                   DMA2DSZ2            __at(0x1DE72);	// @ (0x3BCE * 8 + 2)
#define                                 DMA2DSZ2_bit        _BIT_ACCESS(DMA2DSZL,2)
// DMA2DSZL<DMA2DSZ3>
extern volatile __bit                   DMA2DSZ3            __at(0x1DE73);	// @ (0x3BCE * 8 + 3)
#define                                 DMA2DSZ3_bit        _BIT_ACCESS(DMA2DSZL,3)
// DMA2DSZL<DMA2DSZ4>
extern volatile __bit                   DMA2DSZ4            __at(0x1DE74);	// @ (0x3BCE * 8 + 4)
#define                                 DMA2DSZ4_bit        _BIT_ACCESS(DMA2DSZL,4)
// DMA2DSZL<DMA2DSZ5>
extern volatile __bit                   DMA2DSZ5            __at(0x1DE75);	// @ (0x3BCE * 8 + 5)
#define                                 DMA2DSZ5_bit        _BIT_ACCESS(DMA2DSZL,5)
// DMA2DSZL<DMA2DSZ6>
extern volatile __bit                   DMA2DSZ6            __at(0x1DE76);	// @ (0x3BCE * 8 + 6)
#define                                 DMA2DSZ6_bit        _BIT_ACCESS(DMA2DSZL,6)
// DMA2DSZL<DMA2DSZ7>
extern volatile __bit                   DMA2DSZ7            __at(0x1DE77);	// @ (0x3BCE * 8 + 7)
#define                                 DMA2DSZ7_bit        _BIT_ACCESS(DMA2DSZL,7)
// DMA2DSZH<DMA2DSZ8>
extern volatile __bit                   DMA2DSZ8            __at(0x1DE78);	// @ (0x3BCF * 8 + 0)
#define                                 DMA2DSZ8_bit        _BIT_ACCESS(DMA2DSZH,0)
// DMA2DSZH<DMA2DSZ9>
extern volatile __bit                   DMA2DSZ9            __at(0x1DE79);	// @ (0x3BCF * 8 + 1)
#define                                 DMA2DSZ9_bit        _BIT_ACCESS(DMA2DSZH,1)
// DMA2CON0<DMA2EN>
extern volatile __bit                   DMA2EN              __at(0x1DEE7);	// @ (0x3BDC * 8 + 7)
#define                                 DMA2EN_bit          _BIT_ACCESS(DMA2CON0,7)
// PMD7<DMA2MD>
extern volatile __bit                   DMA2MD              __at(0x1CE39);	// @ (0x39C7 * 8 + 1)
#define                                 DMA2MD_bit          _BIT_ACCESS(PMD7,1)
// PIE5<DMA2ORIE>
extern volatile __bit                   DMA2ORIE            __at(0x1CCAC);	// @ (0x3995 * 8 + 4)
#define                                 DMA2ORIE_bit        _BIT_ACCESS(PIE5,4)
// PIR5<DMA2ORIF>
extern volatile __bit                   DMA2ORIF            __at(0x1CD2C);	// @ (0x39A5 * 8 + 4)
#define                                 DMA2ORIF_bit        _BIT_ACCESS(PIR5,4)
// IPR5<DMA2ORIP>
extern volatile __bit                   DMA2ORIP            __at(0x1CC2C);	// @ (0x3985 * 8 + 4)
#define                                 DMA2ORIP_bit        _BIT_ACCESS(IPR5,4)
// DMA2PR<DMA2PR0>
extern volatile __bit                   DMA2PR0             __at(0x1CFA0);	// @ (0x39F4 * 8 + 0)
#define                                 DMA2PR0_bit         _BIT_ACCESS(DMA2PR,0)
// DMA2PR<DMA2PR1>
extern volatile __bit                   DMA2PR1             __at(0x1CFA1);	// @ (0x39F4 * 8 + 1)
#define                                 DMA2PR1_bit         _BIT_ACCESS(DMA2PR,1)
// DMA2PR<DMA2PR2>
extern volatile __bit                   DMA2PR2             __at(0x1CFA2);	// @ (0x39F4 * 8 + 2)
#define                                 DMA2PR2_bit         _BIT_ACCESS(DMA2PR,2)
// DMA2SCNTL<DMA2SCNT0>
extern volatile __bit                   DMA2SCNT0           __at(0x1DE90);	// @ (0x3BD2 * 8 + 0)
#define                                 DMA2SCNT0_bit       _BIT_ACCESS(DMA2SCNTL,0)
// DMA2SCNTL<DMA2SCNT1>
extern volatile __bit                   DMA2SCNT1           __at(0x1DE91);	// @ (0x3BD2 * 8 + 1)
#define                                 DMA2SCNT1_bit       _BIT_ACCESS(DMA2SCNTL,1)
// DMA2SCNTH<DMA2SCNT10>
extern volatile __bit                   DMA2SCNT10          __at(0x1DE9A);	// @ (0x3BD3 * 8 + 2)
#define                                 DMA2SCNT10_bit      _BIT_ACCESS(DMA2SCNTH,2)
// DMA2SCNTH<DMA2SCNT11>
extern volatile __bit                   DMA2SCNT11          __at(0x1DE9B);	// @ (0x3BD3 * 8 + 3)
#define                                 DMA2SCNT11_bit      _BIT_ACCESS(DMA2SCNTH,3)
// DMA2SCNTL<DMA2SCNT2>
extern volatile __bit                   DMA2SCNT2           __at(0x1DE92);	// @ (0x3BD2 * 8 + 2)
#define                                 DMA2SCNT2_bit       _BIT_ACCESS(DMA2SCNTL,2)
// DMA2SCNTL<DMA2SCNT3>
extern volatile __bit                   DMA2SCNT3           __at(0x1DE93);	// @ (0x3BD2 * 8 + 3)
#define                                 DMA2SCNT3_bit       _BIT_ACCESS(DMA2SCNTL,3)
// DMA2SCNTL<DMA2SCNT4>
extern volatile __bit                   DMA2SCNT4           __at(0x1DE94);	// @ (0x3BD2 * 8 + 4)
#define                                 DMA2SCNT4_bit       _BIT_ACCESS(DMA2SCNTL,4)
// DMA2SCNTL<DMA2SCNT5>
extern volatile __bit                   DMA2SCNT5           __at(0x1DE95);	// @ (0x3BD2 * 8 + 5)
#define                                 DMA2SCNT5_bit       _BIT_ACCESS(DMA2SCNTL,5)
// DMA2SCNTL<DMA2SCNT6>
extern volatile __bit                   DMA2SCNT6           __at(0x1DE96);	// @ (0x3BD2 * 8 + 6)
#define                                 DMA2SCNT6_bit       _BIT_ACCESS(DMA2SCNTL,6)
// DMA2SCNTL<DMA2SCNT7>
extern volatile __bit                   DMA2SCNT7           __at(0x1DE97);	// @ (0x3BD2 * 8 + 7)
#define                                 DMA2SCNT7_bit       _BIT_ACCESS(DMA2SCNTL,7)
// DMA2SCNTH<DMA2SCNT8>
extern volatile __bit                   DMA2SCNT8           __at(0x1DE98);	// @ (0x3BD3 * 8 + 0)
#define                                 DMA2SCNT8_bit       _BIT_ACCESS(DMA2SCNTH,0)
// DMA2SCNTH<DMA2SCNT9>
extern volatile __bit                   DMA2SCNT9           __at(0x1DE99);	// @ (0x3BD3 * 8 + 1)
#define                                 DMA2SCNT9_bit       _BIT_ACCESS(DMA2SCNTH,1)
// PIE5<DMA2SCNTIE>
extern volatile __bit                   DMA2SCNTIE          __at(0x1CCAA);	// @ (0x3995 * 8 + 2)
#define                                 DMA2SCNTIE_bit      _BIT_ACCESS(PIE5,2)
// PIR5<DMA2SCNTIF>
extern volatile __bit                   DMA2SCNTIF          __at(0x1CD2A);	// @ (0x39A5 * 8 + 2)
#define                                 DMA2SCNTIF_bit      _BIT_ACCESS(PIR5,2)
// IPR5<DMA2SCNTIP>
extern volatile __bit                   DMA2SCNTIP          __at(0x1CC2A);	// @ (0x3985 * 8 + 2)
#define                                 DMA2SCNTIP_bit      _BIT_ACCESS(IPR5,2)
// DMA2SIRQ<DMA2SIRQ0>
extern volatile __bit                   DMA2SIRQ0           __at(0x1DEF8);	// @ (0x3BDF * 8 + 0)
#define                                 DMA2SIRQ0_bit       _BIT_ACCESS(DMA2SIRQ,0)
// DMA2SIRQ<DMA2SIRQ1>
extern volatile __bit                   DMA2SIRQ1           __at(0x1DEF9);	// @ (0x3BDF * 8 + 1)
#define                                 DMA2SIRQ1_bit       _BIT_ACCESS(DMA2SIRQ,1)
// DMA2SIRQ<DMA2SIRQ2>
extern volatile __bit                   DMA2SIRQ2           __at(0x1DEFA);	// @ (0x3BDF * 8 + 2)
#define                                 DMA2SIRQ2_bit       _BIT_ACCESS(DMA2SIRQ,2)
// DMA2SIRQ<DMA2SIRQ3>
extern volatile __bit                   DMA2SIRQ3           __at(0x1DEFB);	// @ (0x3BDF * 8 + 3)
#define                                 DMA2SIRQ3_bit       _BIT_ACCESS(DMA2SIRQ,3)
// DMA2SIRQ<DMA2SIRQ4>
extern volatile __bit                   DMA2SIRQ4           __at(0x1DEFC);	// @ (0x3BDF * 8 + 4)
#define                                 DMA2SIRQ4_bit       _BIT_ACCESS(DMA2SIRQ,4)
// DMA2SIRQ<DMA2SIRQ5>
extern volatile __bit                   DMA2SIRQ5           __at(0x1DEFD);	// @ (0x3BDF * 8 + 5)
#define                                 DMA2SIRQ5_bit       _BIT_ACCESS(DMA2SIRQ,5)
// DMA2SIRQ<DMA2SIRQ6>
extern volatile __bit                   DMA2SIRQ6           __at(0x1DEFE);	// @ (0x3BDF * 8 + 6)
#define                                 DMA2SIRQ6_bit       _BIT_ACCESS(DMA2SIRQ,6)
// DMA2CON0<DMA2SIRQEN>
extern volatile __bit                   DMA2SIRQEN          __at(0x1DEE6);	// @ (0x3BDC * 8 + 6)
#define                                 DMA2SIRQEN_bit      _BIT_ACCESS(DMA2CON0,6)
// DMA2SPTRL<DMA2SPTR0>
extern volatile __bit                   DMA2SPTR0           __at(0x1DEA0);	// @ (0x3BD4 * 8 + 0)
#define                                 DMA2SPTR0_bit       _BIT_ACCESS(DMA2SPTRL,0)
// DMA2SPTRL<DMA2SPTR1>
extern volatile __bit                   DMA2SPTR1           __at(0x1DEA1);	// @ (0x3BD4 * 8 + 1)
#define                                 DMA2SPTR1_bit       _BIT_ACCESS(DMA2SPTRL,1)
// DMA2SPTRH<DMA2SPTR10>
extern volatile __bit                   DMA2SPTR10          __at(0x1DEAA);	// @ (0x3BD5 * 8 + 2)
#define                                 DMA2SPTR10_bit      _BIT_ACCESS(DMA2SPTRH,2)
// DMA2SPTRH<DMA2SPTR11>
extern volatile __bit                   DMA2SPTR11          __at(0x1DEAB);	// @ (0x3BD5 * 8 + 3)
#define                                 DMA2SPTR11_bit      _BIT_ACCESS(DMA2SPTRH,3)
// DMA2SPTRH<DMA2SPTR12>
extern volatile __bit                   DMA2SPTR12          __at(0x1DEAC);	// @ (0x3BD5 * 8 + 4)
#define                                 DMA2SPTR12_bit      _BIT_ACCESS(DMA2SPTRH,4)
// DMA2SPTRH<DMA2SPTR13>
extern volatile __bit                   DMA2SPTR13          __at(0x1DEAD);	// @ (0x3BD5 * 8 + 5)
#define                                 DMA2SPTR13_bit      _BIT_ACCESS(DMA2SPTRH,5)
// DMA2SPTRH<DMA2SPTR14>
extern volatile __bit                   DMA2SPTR14          __at(0x1DEAE);	// @ (0x3BD5 * 8 + 6)
#define                                 DMA2SPTR14_bit      _BIT_ACCESS(DMA2SPTRH,6)
// DMA2SPTRH<DMA2SPTR15>
extern volatile __bit                   DMA2SPTR15          __at(0x1DEAF);	// @ (0x3BD5 * 8 + 7)
#define                                 DMA2SPTR15_bit      _BIT_ACCESS(DMA2SPTRH,7)
// DMA2SPTRU<DMA2SPTR16>
extern volatile __bit                   DMA2SPTR16          __at(0x1DEB0);	// @ (0x3BD6 * 8 + 0)
#define                                 DMA2SPTR16_bit      _BIT_ACCESS(DMA2SPTRU,0)
// DMA2SPTRU<DMA2SPTR17>
extern volatile __bit                   DMA2SPTR17          __at(0x1DEB1);	// @ (0x3BD6 * 8 + 1)
#define                                 DMA2SPTR17_bit      _BIT_ACCESS(DMA2SPTRU,1)
// DMA2SPTRU<DMA2SPTR18>
extern volatile __bit                   DMA2SPTR18          __at(0x1DEB2);	// @ (0x3BD6 * 8 + 2)
#define                                 DMA2SPTR18_bit      _BIT_ACCESS(DMA2SPTRU,2)
// DMA2SPTRU<DMA2SPTR19>
extern volatile __bit                   DMA2SPTR19          __at(0x1DEB3);	// @ (0x3BD6 * 8 + 3)
#define                                 DMA2SPTR19_bit      _BIT_ACCESS(DMA2SPTRU,3)
// DMA2SPTRL<DMA2SPTR2>
extern volatile __bit                   DMA2SPTR2           __at(0x1DEA2);	// @ (0x3BD4 * 8 + 2)
#define                                 DMA2SPTR2_bit       _BIT_ACCESS(DMA2SPTRL,2)
// DMA2SPTRU<DMA2SPTR20>
extern volatile __bit                   DMA2SPTR20          __at(0x1DEB4);	// @ (0x3BD6 * 8 + 4)
#define                                 DMA2SPTR20_bit      _BIT_ACCESS(DMA2SPTRU,4)
// DMA2SPTRU<DMA2SPTR21>
extern volatile __bit                   DMA2SPTR21          __at(0x1DEB5);	// @ (0x3BD6 * 8 + 5)
#define                                 DMA2SPTR21_bit      _BIT_ACCESS(DMA2SPTRU,5)
// DMA2SPTRL<DMA2SPTR3>
extern volatile __bit                   DMA2SPTR3           __at(0x1DEA3);	// @ (0x3BD4 * 8 + 3)
#define                                 DMA2SPTR3_bit       _BIT_ACCESS(DMA2SPTRL,3)
// DMA2SPTRL<DMA2SPTR4>
extern volatile __bit                   DMA2SPTR4           __at(0x1DEA4);	// @ (0x3BD4 * 8 + 4)
#define                                 DMA2SPTR4_bit       _BIT_ACCESS(DMA2SPTRL,4)
// DMA2SPTRL<DMA2SPTR5>
extern volatile __bit                   DMA2SPTR5           __at(0x1DEA5);	// @ (0x3BD4 * 8 + 5)
#define                                 DMA2SPTR5_bit       _BIT_ACCESS(DMA2SPTRL,5)
// DMA2SPTRL<DMA2SPTR6>
extern volatile __bit                   DMA2SPTR6           __at(0x1DEA6);	// @ (0x3BD4 * 8 + 6)
#define                                 DMA2SPTR6_bit       _BIT_ACCESS(DMA2SPTRL,6)
// DMA2SPTRL<DMA2SPTR7>
extern volatile __bit                   DMA2SPTR7           __at(0x1DEA7);	// @ (0x3BD4 * 8 + 7)
#define                                 DMA2SPTR7_bit       _BIT_ACCESS(DMA2SPTRL,7)
// DMA2SPTRH<DMA2SPTR8>
extern volatile __bit                   DMA2SPTR8           __at(0x1DEA8);	// @ (0x3BD5 * 8 + 0)
#define                                 DMA2SPTR8_bit       _BIT_ACCESS(DMA2SPTRH,0)
// DMA2SPTRH<DMA2SPTR9>
